app/Http/Controllers/HomeController.php

select * from `bidang` where `bidang`.`id` in (1, 2, 3, 4, 5, 6)
select * from `pegawai`
---
    public function index()
    {
        $gender = Pegawai::getTotalGender();
        $bidang = Pegawai::with('bidang')
            ->get()
            ->groupBy('bidang_id')
            ->sortKeys();