app/Http/Controllers/PegawaiController.php

select count(*) as aggregate from `pegawai`
---
    public function index(Request $request)
    {
        try {
            // 1. Ambil kriteria filter array dari request GET query string
            $filters = $request->only([
                'search',
                'bidang_ids',
                'jabatan_ids',
                'pangkat_ids',
                'pendidikans',
                'statuses'
            ]);

            // 2. Format ulang filter agar dipetakan secara presisi ke dalam prop stateFilters di React frontend
            $stateFilters = [
                'search'      => $request->input('search', ''),
                'bidang_id'   => $request->input('bidang_ids', []),
                'jabatan_id'  => $request->input('jabatan_ids', []),
                'pangkat_id'  => $request->input('pangkat_ids', []),
                'pendidikans' => $request->input('pendidikans', []),
                'statuses'    => $request->input('statuses', []),
            ];

            // 3. Ambil data paginasi dari service
            $paginatedPegawai = $this->pegawaiService->getFilteredPegawais($filters, 10);

            return Inertia::render('admin/pegawai/index', [
                // Menggunakan ->items() untuk mengambil data array murni di dalam paginasi
                // agar cocok dengan pemanggilan `pegawaiList.map()` di React frontend
                'pegawaiList'  => $paginatedPegawai,
                'bidangList'   => Bidang::all(),
                'jabatanList'  => Jabatan::all(),
                'pangkatList'  => Pangkat::all(),
                'stateFilters' => $stateFilters,
            ]);