app/Http/Controllers/PegawaiController.php


        // Filter Bidang
        if ($request->filled('bidang')) {
            $query->whereIn('bidang_id', $request->bidang);
---
select * from `bidang` where `bidang`.`id` in (1, 3, 4, 6)

        $pegawai = $query->paginate(10)->withQueryString();

        // Get bidang options for filter
        $bidangOptions = Bidang::pluck('nama_bidang', 'id')->toArray();
---
select `nama_bidang`, `id` from `bidang`

    public function show($id)
    {
        $pegawai = Pegawai::findOrFail($id);
        $pendidikanTerakhir = $pegawai->riwayatPendidikan()->latest('tahun_lulus')->first();
---
select * from `pegawai` where `pegawai`.`id` = '1' limit 1
select * from `pegawai` limit 10 offset 30
select * from `riwayat_pendidikan` where `riwayat_pendidikan`.`pegawai_id` = 1 and `riwayat_pendidikan`.`pegawai_id` is not null order by `tahun_lulus` desc limit 1

    public function create()
    {
        $pangkat = Pangkat::all();
        $bidang = Bidang::all();
---
select * from `pangkat`
select * from `bidang`