app/Models/Pegawai.php

    public static function getTotalGender()
    {
        return [
            'total' => Pegawai::count(),
            'lakiLaki' => Pegawai::where('jns_kelamin', 'L')->count(),
            'perempuan' => Pegawai::where('jns_kelamin', 'P')->count(),
---
select count(*) as aggregate from `pegawai` where `jns_kelamin` = 'L'
select count(*) as aggregate from `pegawai` where `jns_kelamin` = 'P'